xmlsamples/PI_MTCN/DE-SMS-BIS.xml

<soapenv:Envelope xmlns:xrsi="http://www.westernunion.com/schema/xrsi" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <ns2:esp-send-money-store-request xmlns:ns2="http://www.westernunion.com/schema/xrsi">
         <partner>
            <id>WGBSDE5840P</id>
            <system>
               <id>WGBSDE5840P</id>
               <name>KTB BANK</name>
               <version>9101</version>
               <ip_address>192.168.49.20</ip_address>
               <connector>
                  <id>DE584PST001A</id>
               </connector>
            </system>
         </partner>
         <device>
            <id>Online</id>
            <type>RETAIL</type>
         </device>
         <external_reference_no>1</external_reference_no>
         <sender>
            <name name_type="D">
               <first_name>Loyce</first_name>
               <last_name>Hills</last_name>
               <given_name/>
               <paternal_name/>
               <maternal_name/>
            </name>
            <address>
               <addr_line1>McCullough Place</addr_line1>
               <addr_line2/>
               <city>BKKwedfewdf</city>
               <state>Germany</state>
               <postal_code>10130</postal_code>
               <country_iso_code>DE</country_iso_code>
               <country_code>
                  <country_name>Germany</country_name>
               </country_code>
            </address>
            <compliance_details>
               <template_id>UNI_01</template_id>
               <version>null</version>
               <id_documents>
                  <id_document>
                     <type>A</type>
                     <data>C46400079</data>
                     <issue_date>01032012</issue_date>
                     <issue_place>Germany</issue_place>
                     <issue_country>
                        <iso_code>
                           <country_code>DE</country_code>
                        </iso_code>
                        <country_name>Germany</country_name>
                     </issue_country>
                     <expiration_date>31032028</expiration_date>
                     <id_expires>true</id_expires>
                  </id_document>
                  <id_document>
                     <type>A</type>
                     <data>89562147</data>
                     <issue_date/>
                     <issue_country>
                        <iso_code>
                           <country_code>DE</country_code>
                        </iso_code>
                        <country_name>Germany</country_name>
                     </issue_country>
                     <expiration_date/>
                     <id_expires>false</id_expires>
                  </id_document>
               </id_documents>
               <third_party_details>
                  <name>
                     <first_name/>
                     <last_name/>
                  </name>
                  <address>
                     <addr_line1/>
                     <addr_line2/>
                     <city/>
                     <state_name/>
                     <state_code/>
                     <postal_code/>
                     <country/>
                     <street/>
                  </address>
                  <organization/>
                  <occupation/>
                  <flag_pay>N</flag_pay>
                  <id_details>
                     <id_type/>
                     <id_country_of_issue/>
                     <id_place_of_issue/>
                     <id_number/>
                  </id_details>
                  <Id_Ack_Flag>Y</Id_Ack_Flag>
               </third_party_details>
               <date_of_birth>19121990</date_of_birth>
               <occupation>Housewife/Child Care</occupation>
               <compliance_comments>No Comments</compliance_comments>
               <transaction_reason>Emergency/Medical Aid</transaction_reason>
               <Current_address>
                  <addr_line1>McCullough Place</addr_line1>
                  <addr_line2>Fay Inlet</addr_line2>
                  <city>BKKwedfewdf</city>
                  <state_name>Germany</state_name>
                  <state_code>Germany</state_code>
                  <postal_code>10130</postal_code>
                  <country>Germany</country>
                  <locale/>
                  <address_type/>
                  <business_name/>
                  <zip>10130</zip>
                  <street>McCullough Place</street>
                  <district/>
               </Current_address>
               <contact_phone/>
               <email>HJHhjjhkhK@mmail.com</email>
               <Country_of_Birth>Germany</Country_of_Birth>
               <nationality>Germany</nationality>
               <Gender>M</Gender>
               <Source_of_Funds>Cash Tips</Source_of_Funds>
               <Name_of_Employer_Business/>
               <Nature_of_Work_Business/>
               <Is_txn_Individual_or_Organization>I</Is_txn_Individual_or_Organization>
               <Relationship_to_Receiver_Sender>Family</Relationship_to_Receiver_Sender>
               <Other_Relationship_to_Sender/>
               <address_validation>true</address_validation>
               <Does_the_ID_have_an_expiration_date/>
               <Address_verification_document_type/>
               <Address_verification_document_number/>
               <City_of_Birth>Medellin</City_of_Birth>
               <Personal_Identification_Number>78596231408</Personal_Identification_Number>
               <I_act_on_My_Behalf>N</I_act_on_My_Behalf>
               <ack_flag>1</ack_flag>
               <Address_Verification_Document_Issue_Date/>
               <Other_Occupation>Driver</Other_Occupation>
               <Marital_Status>SINGLE</Marital_Status>
               <Other_Purpose_Of_Transaction>Sender_Purpose_2</Other_Purpose_Of_Transaction>
               <maiden_name>Kanumuri</maiden_name>
               <Address_Verification_Issuer/>
               <Politically_Exposed_Person>N</Politically_Exposed_Person>
               <employers_address_line1>Avenue</employers_address_line1>
               <employers_address_line2>Thailand</employers_address_line2>
               <Business_Phone_Number>865412345</Business_Phone_Number>
               <Relative_Or_CloseFriend_Of_PEP>Y</Relative_Or_CloseFriend_Of_PEP>
               <Annual_Income>100000000</Annual_Income>
               <Status_Of_Employment/>
               <Primary_ID_Image>
                  <referenceNumber>GBIDA0F52188294E2C</referenceNumber>
               </Primary_ID_Image>
               <FLA_Sign_RefNo>RF123456</FLA_Sign_RefNo>
               <Custmr_Consent_Sign_RefNo>RF123456</Custmr_Consent_Sign_RefNo>
               <Custmr_Sign_RefNo>RF123456</Custmr_Sign_RefNo>
               <Temporary_Address>
                  <addr_line1>McCullough Place</addr_line1>
                  <city>BKKwedfewdf</city>
                  <state_name>Germany</state_name>
                  <state_code>Germany</state_code>
                  <postal_code>10130</postal_code>
                  <country>Germany</country>
                  <street/>
               </Temporary_Address>
               <does_the_ID_have_an_issue_date/>
               <cust_relationship_flag>Y</cust_relationship_flag>
               <second_id_doc_control_number>ID2222</second_id_doc_control_number>
               <prmt_proof_of_addr_doc_control_number>1234</prmt_proof_of_addr_doc_control_number>
               <temp_proof_of_addr_doc_control_number>TPADCN11111</temp_proof_of_addr_doc_control_number>
               <emp_status_doc_control_number>ESDCN11111</emp_status_doc_control_number>
               <purpose_of_txn_doc_control_number>POTDCN11111</purpose_of_txn_doc_control_number>
            </compliance_details>
            <email>HJHhjjhkhK@mmail.com</email>
            <contact_phone>027856931</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>973</country_code>
                  <national_number>027856931</national_number>
                  <telephone_city_code>973</telephone_city_code>
               </phone_number>
            </mobile_phone>
            <mobile_details>
               <city_code>973</city_code>
               <number>027856931</number>
            </mobile_details>
            <language_id/>
            <notification_preference>NONE</notification_preference>
            <sms_notification_flag>Y</sms_notification_flag>
            <bank_account>
               <name>KTB</name>
               <account_number>0211999999</account_number>
               <routing_number/>
               <account_type>Savings</account_type>
            </bank_account>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>Viola</first_name>
               <last_name>Sawayn</last_name>
               <given_name/>
               <paternal_name/>
               <maternal_name/>
            </name>
            <address/>
            <contact_phone>1297046055</contact_phone>
            <mobile_phone>
               <phone_number>
                  <country_code>973</country_code>
                  <national_number>1297046055</national_number>
               </phone_number>
            </mobile_phone>
            <bank_account>
               <name>KTB</name>
               <bank_location/>
               <branch_code/>
               <bank_code/>
               <sort_code/>
               <account_number>0211999999</account_number>
               <routing_number/>
               <account_type>Savings</account_type>
               <account_holder/>
            </bank_account>
         </receiver>
         <wu_product>
            <name>MONEY IN MINUTES</name>
            <code>000</code>
            <routing_code/>
         </wu_product>
         <transaction_type/>
         <payment_details>
            <origination>
               <principal_amount>100000</principal_amount>
               <gross_amount>105000</gross_amount>
               <currency_iso_code>EUR</currency_iso_code>
               <country_iso_code>DE</country_iso_code>
            </origination>
            <destination>
               <expected_payout_amount>100000</expected_payout_amount>
               <currency_iso_code>EUR</currency_iso_code>
               <country_iso_code>DE</country_iso_code>
               <state_code>NJ</state_code>
               <city>Jersy city</city>
            </destination>
            <promotion>
               <name/>
               <description/>
               <discount>0</discount>
               <message/>
            </promotion>
            <taxes>
               <municipal_tax>0</municipal_tax>
               <state_tax>0</state_tax>
               <county_tax>0</county_tax>
            </taxes>
            <fees>
               <base_charges>5000</base_charges>
               <delivery_charges>0</delivery_charges>
               <other_charges>0</other_charges>
            </fees>
            <exchange_rate>1.0000000</exchange_rate>
            <identification_question/>
            <payment_type/>
         </payment_details>
         <fraud_warning_consent>Y</fraud_warning_consent>
         <temp_transaction_id>2400483940122670</temp_transaction_id>
         <transaction_digest>45C94CCF22CC637665039447E97B30F47578A2EF</transaction_digest>
         <df_details>
            <df_txn_flag>N</df_txn_flag>
            <mkt_lang_list>EN,ES</mkt_lang_list>
            <total_to_receiver>100000</total_to_receiver>
            <csb_url/>
            <dlv_svc_name>null</dlv_svc_name>
         </df_details>
         <mtcn_digest/>
         <host_based_taxes>Y</host_based_taxes>
         <GDPR_enabled>N</GDPR_enabled>
         <partner_info_buffer>
            <partner_branded>
               <principal_amount>1000.00</principal_amount>
               <exchange_rate>1.0000000</exchange_rate>
               <fx_spread>+10.000</fx_spread>
            </partner_branded>
         </partner_info_buffer>
      </ns2:esp-send-money-store-request>
   </soapenv:Body>
</soapenv:Envelope>